snlkuharlocal/src/Documents/ТоварныйДокумент/ТоварныйДокумент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТоварныйДокумент</name>
  <comment>Товарный документ</comment>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.Перемещение</basedOn>
  <basedOn>Document.ОприходованиеТМЦ</basedOn>
  <basedOn>Document.ТоварныйДокумент</basedOn>
  <basedOn>Document.РекламационнаяНакладная</basedOn>
  <registerRecords>AccumulationRegister.СтоимостьДоставки</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиГТД</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТМЦзабаланс</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемКоробов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКоробок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦенРаспродажа</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСкидок</name>
    <type>
      <types>CatalogRef.ТипыСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>СписыватьГТД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГТД</name>
    <type>
      <types>CatalogRef.ГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНомерСчетаФактуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокВходящий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокВходящий</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоРасч</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБезСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоБезСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <comment>Скидка %</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЦен</name>
      <type>
        <types>CatalogRef.ТипыЦен</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/ОстаткиГТД/ОстаткиГТД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиГТД</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГТД</name>
    <type>
      <types>CatalogRef.ГТД</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Documents/ТоварныйДокумент/ObjectModule.bsl
//СОБЫТИЯ ОБЪЕКТА
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	ЕстьИзменения	=Модифицированность();
	НужноВыгружать	=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	
	Если НЕ ОбменДанными.Загрузка Тогда
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		
		Если Отказ Тогда Возврат КонецЕсли;		
	КонецЕсли;
	
	Если ЕстьИзменения Тогда 
		СуммаДокумента		= Товары.Итог("Всего");
		ОбъемДокумента		= Товары.Итог("Объем");
		КоличествоДокумента = Товары.Итог("Количество");
				
		ГруппыТоваров   	= ГруппыТоваровДокумента(ЭтотОбъект);
	КонецЕсли; 
		
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
	КонецЕсли;	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	СостояниеНакладной	=Неопределено;
	Автор				=Неопределено;
	
	ДатаВыгрузки		=Неопределено;
	Валюта				=Неопределено;
	Курс				=Неопределено;	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)	
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;
	Если Основание=Неопределено ИЛИ Основание.Пустая() Тогда Возврат КонецЕсли;
		
	ВидОснования	= Основание.Метаданные().Имя;		
	ДокОснование	= Основание;	
	Если ЕстьРеквизитДокумента("ИБ",Основание.Метаданные()) Тогда
		ИБ				= Основание.ИБ;		
	КонецЕсли;	
	
	Товары.Очистить();
	Для Каждого СтрокаОснования Из Основание.Товары Цикл
		Если СтрокаОснования.Количество>0 Тогда
			СтрокаТЧ=Товары.Добавить();				
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтрокаОснования);
		КонецЕсли;	
	КонецЦикла; 
КонецПроцедуры

Процедура ПровестПоГТД(Записывать=Ложь) Экспорт
	Если НЕ СписыватьГТД Тогда
		Движения.ОстаткиГТД.Очистить();
		Если НЕ ГТД.Пустая() Тогда
			Для Каждого СтрокаТЧ Из Товары Цикл
				Движение=Движения.ОстаткиГТД.Добавить();			
				Движение.ВидДвижения=ВидДвиженияНакопления.Приход;
				Движение.Период=Дата;
				Движение.ГТД=ГТД;
				Движение.Количество=СтрокаТЧ.Количество;
				Движение.Номенклатура=СтрокаТЧ.Номенклатура;			
			КонецЦикла;		
		КонецЕсли; 
	Иначе		
		Запрос=Новый Запрос;
		Запрос.МенеджерВременныхТаблиц=Новый МенеджерВременныхТаблиц;
		
		Запрос.Текст="
		|ВЫБРАТЬ
		|	Номенклатура КАК Модель,
		|	СУММА(Количество) КАК Количество
		|ПОМЕСТИТЬ ТЧ
		|ИЗ
		|	Документ.ТоварныйДокумент.Товары
		|ГДЕ
		|	Ссылка = &Ссылка
		|	И Номенклатура.ЭтоГруппа
		|СГРУППИРОВАТЬ ПО
		|	Номенклатура";
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		Запрос.Выполнить();	
		
		Запрос.Текст="
		|ВЫБРАТЬ
		|	Номенклатура КАК Модель,
		|	ГТД,
		|	КоличествоОстаток КАК Остаток 
		|ПОМЕСТИТЬ Остатки
		|ИЗ
		|	РегистрНакопления.ОстаткиГТД.Остатки(&Дата1,ГТД<>&ПустаяГТД И Номенклатура В (ВЫБРАТЬ РАЗЛИЧНЫЕ МОДЕЛЬ ИЗ ТЧ))";
		
		Запрос.УстановитьПараметр("Дата1",Новый Граница(МоментВремени(),ВидГраницы.Исключая));
		Запрос.УстановитьПараметр("ПустаяГТД",Справочники.ГТД.ПустаяСсылка());
		
		Запрос.Выполнить();
		
		Запрос.Текст="
		|ВЫБРАТЬ
		|	Остатки.Модель,
		|	Остатки.ГТД КАК ГТД,
		|	Остатки.Остаток
		|ИЗ
		|	Остатки
		|ИТОГИ СУММА(Остаток) ПО Модель";
		
		Остатки=Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
		Для Каждого СтрокаТЧ  Из Товары Цикл		
			НадоСписать=СтрокаТЧ.Количество;
			СтрокаОстаткаПоМодели=Остатки.Строки.Найти(СтрокаТЧ.Номенклатура,"Модель",Ложь);
			
			Если СтрокаОстаткаПоМодели<>Неопределено Тогда
				Для Каждого СтрокаОстатка Из СтрокаОстаткаПоМодели.Строки Цикл
					Если НадоСписать>0 Тогда
						ТекКол=Макс(Мин(НадоСписать,СтрокаОстатка.Остаток),0);
						Если ТекКол>0 Тогда
							Движение=Движения.ОстаткиГТД.Добавить();		
							
							Движение.Период=Дата;
							Движение.ВидДвижения	=ВидДвиженияНакопления.Расход;
							
							Движение.Номенклатура	=СтрокаТЧ.Номенклатура;
							Движение.ГТД			=СтрокаОстатка.ГТД;
							
							Движение.Количество=ТекКол;
							
							НадоСписать=НадоСписать-ТекКол;						
						КонецЕсли; 
					Иначе 
						Прервать;					
					КонецЕсли;				
				КонецЦикла;
			КонецЕсли;		
			
			Если НадоСписать>0 Тогда
				Движение=Движения.ОстаткиГТД.Добавить();		
				
				Движение.Период=Дата;
				Движение.ВидДвижения	=ВидДвиженияНакопления.Расход;
				
				Движение.Номенклатура	=СтрокаТЧ.Номенклатура;
				Движение.ГТД			=Неопределено;
				
				Движение.Количество		=НадоСписать;			
			КонецЕсли; 
		КонецЦикла;	
	КонецЕсли; 
	Если Записывать Тогда
		Движения.ОстаткиГТД.Записать();	
	КонецЕсли;
КонецПроцедуры
 
Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	ПровестПоГТД();
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры
